In [70]:
import pymysql
pymysql.install_as_MySQLdb()
import os
import mysqlx
import pandas as pd
import numpy as np

import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()

from flask import Flask, jsonify, render_template
from flask_sqlalchemy import SQLAlchemy

In [71]:
# Import modules to declare columns and column data types
from sqlalchemy import Column, Integer, String, Float
app = Flask(__name__)

In [72]:
engine = create_engine("mysql://root:Mun&maj@0723@localhost:3306/activities_db")

In [73]:
conn = engine.connect()

In [74]:
Base.metadata.create_all(conn)

In [75]:
from sqlalchemy.orm import Session
session = Session(bind=engine)

In [76]:
# Query All Records in the the City Table
Combined = pd.read_sql("SELECT * FROM combined", conn)
Activities_data=pd.read_sql("SELECT * FROM activities_data", conn)

In [77]:
Combined.head()

,﻿Status,Employment_Status,Sleeping,Housework,FoodPrep,garden_care,Grocery_shopping,Shopping_goods,Caring_children,Physica_care,Education_activities,Reading_children,Playing_w_children,Working,Socializing,Watching_television,Recreation,Travel_children,Other_activities
0,MM0061,1.0,8.09,0.24,0.33,0.16,0.08,0.23,1.25,0.46,0.05,0.05,0.49,6.01,0.60,1.94,0.28,0.12,1.72
1,MM00600,0.0,8.88,0.68,0.59,0.22,0.12,0.28,2.11,0.76,0.11,0.08,0.75,2.22,1.11,3.22,0.35,0.21,2.41
2,MM61715,1.5,8.49,1.00,0.96,0.07,0.14,0.34,2.68,1.26,0.11,0.10,0.71,2.65,0.80,1.57,0.21,0.27,2.02
3,MM6170,0.0,8.92,1.46,1.47,0.11,0.16,0.38,3.25,1.46,0.20,0.11,0.93,0.02,0.85,2.11,0.20,0.29,2.28
4,MF0061,1.0,8.09,0.24,0.33,0.16,0.08,0.23,1.25,0.46,0.05,0.05,0.49,6.01,0.60,1.94,0.28,0.12,1.72

In [78]:
Activities_data.head()

,﻿activity_ID,activity_label,MM0061,MM00600,MM61715,MM6170,MF0061,MF0060,MF61715,MF6170
0,1,Child_sleeping,8.09,8.88,8.49,8.92,8.09,8.88,8.44,8.71
1,2,Housework,0.73,2.45,2.03,3.04,0.73,3.49,2.45,3.30
2,3,Shopping,0.31,0.40,0.46,0.54,0.31,0.40,0.56,1.39
3,4,CaringForChild,2.70,6.00,3.90,4.71,1.71,4.87,1.39,3.81
4,5,Education,0.10,0.17,0.20,0.31,0.10,0.19,0.24,0.36

In [79]:
@app.route("/")
def index():
    """Return the homepage."""
    return render_template("index.html")

In [80]:
@app.route("/names")
def names():
    """Return a list Status."""

    # Use Pandas to perform the sql query
    stmt = session.query(Activities_data).statement
    df = pd.read_sql_query(stmt, session.bind)

    # Return a list of the column names (sample names)
    return jsonify(list(df.columns)[2:])
print(names)

<function names at 0x000001FF8DFD40D0>

In [81]:
@app.route("/metadata/<sample>")
def sample_metadata(sample):
    """Return the MetaData for a given sample."""
    sel = [
        Combined.Status,
        Combined.Housework,
        Combined.Sleeping,
        Combined.Shopping_goods,
        Combined.Working,
            ]

    results = session.query(*sel).filter(Combined.Status == Status).all()

    # Create a dictionary entry for each row of metadata information
    combined = {}
    for result in results:
        combined["Status"] = result[0]
        combined["Housework"] = result[1]
        combined["Sleeping"] = result[2]
        combined["Shopping_goods"] = result[3]
        combined["Working"] = result[4]
        

    print(sample_metadata)
    return jsonify(sample_metadata)

In [82]:
@app.route("/samples/<sample>")
def samples(sample):
    """Return `activitiy_IDS`, `activity_labels`,and `sample_values`."""
    stmt = session.query(Activities_data).statement
    df1 = pd.read_sql_query(stmt, session.bind)

    # Filter the data based on the sample number and
    # only keep rows with values above 1
    sample_data = pd.read_sql("Select activity_ID activity_label Status From Activities_data")
    # Format the data to send as json
    data = {
        "acitivity_IDS": sample_data.activity_ID.values.tolist(),
        "sample_values": sample_data[sample].values.tolist(),
        "acitivity_lables": sample_data.activity_label.tolist(),
    }
    return jsonify(data)

In [ ]:
if __name__ == "__main__":
    app.run()

 * Serving Flask app "__main__" (lazy loading)
 * Environment: production
   WARNING: Do not use the development server in a production environment.
   Use a production WSGI server instead.
 * Debug mode: off

 * Running on http://127.0.0.1:5000/ (Press CTRL+C to quit)